[
{
  "ProjectTitle":"Allmende Labs",
  "Image":"/img/allmendelabs.png",
  "Description": "Architected and built AI-Native SaaS platform",
  "Tools":"React, Go, Material UI, OpenAI, Python, AWS, Auth0, Stripe",
  "Links":[
    {"site": "site", "url":"https://allmendelabs.com"}
  ],
  "PopupText":[
    "After having built out several fullstack apps using AI I decided to build out an AI native app which utilizes LLMs to provide a personalized experience to the users and productize it."
  ]
},
{
  "ProjectTitle":"COVID XPrize",
  "Image":"/img/corona.jpg",
  "Description": "Led ML-Ops and developed website for 1st place national ranking Covid 19 X-Prize challenge",
  "Tools":"AWS, Jupyter, SKLearn, Heroku, Streamlit, Keras",
  "Links":[
    {"site": "article", "url":"https://www.businesswire.com/news/home/20210322005148/en/Metis-Alumni-Win-Honors-at-International-Competition-for-Pandemic-Response"}
  ],
  "PopupText":[
    "After graduation from Metis' data science bootcamp I decided to enter in XPrize's Covid-19 competition along with 7 other alums. The purpose was to leverage AI/ML to presciribe non-pharmaceutical interventions which wouuld limit the spread of Covid-19. For the project I led the ML-ops portion of the project and coded an informational website / dashboard which displayed our model's prescribed interventions for every region in the Oxford-Cambridge Covid dataset."
  ]
},
{
  "ProjectTitle":"Autonomous Vehicle AI",
  "Image":"/img/minicity.png",
  "Description": "Trained autonomous vehicles in a SUMO using reinforcement learning",
  "Tools":"FLOW, RLlib, OpenAI Gym, SUMO, OpenStreetMaps, Tensorflow",
  "Links":[
    {"site": "youtube", "url":"https://youtu.be/qXuBEs9G7Iw"},
    {"site": "github", "url":"https://github.com/rlew631/AutonomousVehicleSimulation"}
  ],
  "PopupText":[
    "The purpose of this project was to create a model which develops autonomous vehicle driving policies using a deep reinforcement learning policy. See my discussion on youtube or the slide deck in the repo which goes over the general framework and the tools."
  ]
},
{
  "ProjectTitle":"Predicting Drug Effects",
  "Image":"/img/dna.png",
  "Description": "Used chemical markers to determine a drug's method-of-action using ML",
  "Tools":"SKLearn, IMBLearn, MatPlotLib, Plotly, Seaborn, Heroku, HTML, JavaScript, CSS",
  "Links":[
    {"site":"github", "url":"https://github.com/rlew631/DrugMethodsOfAction"}
  ],
  "PopupText":[
    "The purpose of this project was to find a relationship between drug attributes and their corresponding methods of action. This could improve the efficiency of the drug development process by selectively eliminating drug candidates which are likely to have additional unwanted MOAs (mechanisms of action) before moving on to the screening and preclinical trial phases of development."
  ]
},
{
  "ProjectTitle":"NLP Stock Filings",
  "Image":"/img/stocks.png",
  "Description": "Used NLP to analyze quarterly filings and predict stock movement based on changes",
  "Tools":"NLTK, BeautifulSoup, Matplotlib, Pandas",
  "Links":[
    {"site":"github","url":"https://github.com/rlew631/NLP_stock_analysis"}
  ],
  "PopupText":[
    "This project is a continuation of the Lazy Prices paper published by Lauren Cohen of HBS which speculated that a magnitude of changes in the content of a company's quarterly filing would indicate that their stock is likely to drop.",
    "My implementation compares the cosine similarity and jaccard score of a given company's filing to the one they filed the previous year. Additionally I wrote a custom sentiment index which uses Loughran McDonald's financial NLP dictionary to determine the overall sentiment of a given year's filing."
  ]
},
{
  "ProjectTitle":"Object Tracking Drone",
  "Image":"/img/drone_cad.png",
  "Description": "Built a computer vision augmented drone to track and follow objects using openCV",
  "Tools":"OpenCV, MAVLink, CNC Programming, Solidworks, FEA (Finite Element Analysis), PID, Linux",
  "Links":[
    {"site":"github","url":"https://github.com/rlew631/ObjectTrackingDrone"}
  ],
  "PopupText":[
    "This project involved building a custom drone and using OpenCV on a Raspberry Pi to perform object tracking."
  ]
},
{
  "ProjectTitle":"Delta Smelt Forecasting",
  "Image":"/img/map.png",
  "Description": "Used water quality data and ML to predict the presence of zooplankton in the San Joaquin Delta",
  "Tools":"SKLearn, Numpy, Pandas, MatPlotLib, Seaborn",
  "Links":[{"site":"github","url":"https://github.com/rlew631/SanJoaquinZooplanktonPredictor"}],
  "PopupText":[
    "The purpose of this project was to predict the presence of aquatic micro-organisms in the San Joaquin Delta based on water quality measurements from USGS. These organisms are a key food source for the endangered Delta Smelt which has experienced a rapid population decline in the last few years."
  ]
},
{
  "ProjectTitle":"Audio Classification",
  "Image":"/img/audio.png",
  "Description":"Developed and trained an AI model to detect and classify spoken words",
  "Tools":"Keras, Numpy, Matplotlib, SciPy, SKImage",
  "Links":[
    {"site":"github","url":"https://github.com/rlew631/SpeechRecognition"}
  ],
  "PopupText":[
    "This project involved taking a dataset which consisted of 30 different spoken words, batching them and converting them to spectrograms in order to perform classification with a custom CNN."
  ]
},
{
  "ProjectTitle":"Formula SAE Race Car",
  "Image":"/img/fsae.jpg",
  "Description":"Led the design and development of an open wheeled race car for the collegiate Formula SAE race series",
  "Tools":"FEA (Finite Element Analysis), DFM (Design for Manufacture), Proposal Writing, Leadership/Communication",
  "PopupText":[
    "I initially proposed this project to the head of the engineering department at my college. We worked together to secure grant funding and coordinated a group of students to develop and build a race car for the annual Formula SAE competition in Michigan.",
    "This project required coordinating with various stakeholders in administration at the college as well as developing design and fabrication workshops for the students to successfully participate."
  ],
  "Links":[
    {"site":"youtube","url":"https://www.youtube.com/watch?v=rsLcJnHyiQ4"},
    {"site":"paper","url":"http://www.laccei.org/LACCEI2019-MontegoBay/student_papers/SP491.pdf"}
  ]
},
{
  "ProjectTitle":"Modified Subaru Track Car",
  "Image":"/img/ecu.png",
  "Description":"Built a track capable street car and custom mapped aftermarket firmware for engine control",
  "Tools":"CANBUS Troubleshooting, Engine and ECU Parameter Logging/Modification, CNC Machining/TIG Welding, Digital Signal Analysis",
  "PopupText":[
    "After purchasing a 2008 Subaru WRX in 2013 using bitcoin mined in a college dorm room I have incrementally upgraded all of the major components in the drivetrain, fuel system, suspension and braking systems with parts which were sourced from OEM and aftermarket vendors as well as custom fabricated pieces.",
    "Most recently I finished building and installing a custom spec engine using the OEM EJ255 case halves, EJ207 cylinder heads sourced from Japan and aftermarket internals. This required tight-tolerance CNC machining, electromechanical troubleshooting, custom wiring/electronics installation and realtime tuning of the fuel, ignition, valve timing maps and sensor calibrations for the engine."
  ],
  "Links":[]
}
]